### Restart and run all

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

format_dict = {'amount':'{:,}',
               'grs_amt':'{:,.2f}','net_amt':'{:,.2f}','refund':'{:,.2f}'}

today = date.today()
today

datetime.date(2022, 3, 31)

In [2]:
sql = '''
SELECT name, p_date, FORMAT(amt,2) AS amt, FORMAT(net,2) AS net, format(amt-net,2) AS refund, year, quarter AS q
FROM dividends
WHERE YEAR(p_date) = 2022
ORDER BY p_date DESC, name ASC'''
dtl_by_month = pd.read_sql(sql, conpf)
dtl_by_month

     name      p_date        amt        net  refund  year  q
0   HREIT  2022-03-30   6,969.38   6,272.44  696.94  2021  4
1  AIMIRT  2022-03-28   2,210.00   1,989.00  221.00  2021  4
2   WHART  2022-03-25   2,390.00   2,151.00  239.00  2021  4
3   JASIF  2022-03-21  27,500.00  27,500.00    0.00  2021  4
4   CPNCG  2022-03-04   2,222.00   1,999.80  222.20  2021  4
5     DIF  2022-03-04  15,660.00  15,660.00    0.00  2021  4
6     LPF  2022-02-15   1,719.00   1,547.10  171.90  2021  4

In [3]:
sql = '''
SELECT YEAR(p_date) AS pay_year, SUM(amt) AS grs_amt, SUM(net) AS net_amt, SUM(amt-net) AS refund
FROM dividends
GROUP BY pay_year
ORDER BY pay_year DESC'''
ttl_by_year = pd.read_sql(sql, conpf)
ttl_by_year.style.format(format_dict)